mutants/patches/monoid-left-identity-always-holds.patch
diff --git a/Sources/PropertyLawKit/Public/MonoidLaws.swift b/Sources/PropertyLawKit/Public/MonoidLaws.swift
index 6cd7812..b372dd7 100644
--- a/Sources/PropertyLawKit/Public/MonoidLaws.swift
+++ b/Sources/PropertyLawKit/Public/MonoidLaws.swift
@@ -54,7 +54,7 @@ private func checkCombineLeftIdentity<
         generator: generator,
         options: options,
         property: { sample in
-            Value.combine(Value.identity, sample) == sample
+            true
         },
         formatCounterexample: { sample, _ in
             let actual = Value.combine(Value.identity, sample)
