mutants/patches/semigroup-associativity-always-holds.patch
diff --git a/Sources/PropertyLawKit/Public/SemigroupLaws.swift b/Sources/PropertyLawKit/Public/SemigroupLaws.swift
index 9d385f8..c77ea6d 100644
--- a/Sources/PropertyLawKit/Public/SemigroupLaws.swift
+++ b/Sources/PropertyLawKit/Public/SemigroupLaws.swift
@@ -46,7 +46,7 @@ private func checkCombineAssociativity<
         property: { one, two, three in
             let leftGrouped = Value.combine(Value.combine(one, two), three)
             let rightGrouped = Value.combine(one, Value.combine(two, three))
-            return leftGrouped == rightGrouped
+            return true
         },
         formatCounterexample: { one, two, three, _ in
             let lhs = Value.combine(Value.combine(one, two), three)
