mutants/patches/walk-does-not-stop-at-first-failure.patch
diff --git a/Sources/PropertyLawKit/Internal/EnumerationDriver.swift b/Sources/PropertyLawKit/Internal/EnumerationDriver.swift
index bcb4891..9951fc5 100644
--- a/Sources/PropertyLawKit/Internal/EnumerationDriver.swift
+++ b/Sources/PropertyLawKit/Internal/EnumerationDriver.swift
@@ -52,7 +52,6 @@ package enum EnumerationDriver {
             do {
                 if try await property(space[index]) == false {
                     outcome = .failed(counterexample: describe(space, index, nil, describeFailure))
-                    break walk
                 }
             } catch {
                 let boxed = ErrorBox(error)
